{
    "a bit": {
        "sentence": [
            "The weather is a bit cold today, so wear your coat.",
            "今天天气有点冷，所以穿上你的外套。"
        ]
    },
    "above": {
        "sentence": [
            "There is a beautiful picture on the wall above the desk.",
            "书桌上方的墙上挂着一幅漂亮的画。"
        ]
    },
    "address": {
        "sentence": [
            "Can you write down your home address on this paper, please?",
            "请在这张纸上写下你的家庭住址好吗？"
        ]
    },
    "after": {
        "sentence": [
            "We usually have a short break after the second English lesson.",
            "通常在第二节英语课后我们会有一次短暂休息。"
        ]
    },
    "afternoon": {
        "sentence": [
            "I often go to the library to read books in the afternoon.",
            "我经常下午去图书馆读书。"
        ]
    },
    "age": {
        "sentence": [
            "What is the age of that tall boy? He is thirteen years old.",
            "那个高个子男孩多大了？他十三岁。"
        ]
    },
    "all": {
        "sentence": [
            "All the students in our class like playing football after school.",
            "我们班所有的学生都喜欢放学后踢足球。"
        ]
    },
    "all right": {
        "sentence": [
            "- Let's go to the park this Sunday. - All right, that sounds great!",
            "—这周日我们去公园吧。—好吧，听起来太棒了！"
        ]
    },
    "always": {
        "sentence": [
            "He is very hardworking and always finishes his homework on time.",
            "他非常努力，总是按时完成作业。"
        ]
    },
    "America": {
        "sentence": [
            "America is a very big country located far across the ocean.",
            "美国是一个位于大洋彼岸的非常大的国家。"
        ]
    },
    "animal": {
        "sentence": [
            "The panda is my favourite animal because it is very cute.",
            "大熊猫是我最喜欢的动物，因为它非常可爱。"
        ]
    },
    "answer": {
        "sentence": [
            "Please raise your hand if you know the answer to the question.",
            "如果你知道那个问题的答案，请举手。"
        ]
    },
    "any": {
        "sentence": [
            "Do you have any English storybooks in your new schoolbag?",
            "你的新书包里有英语故事书吗？"
        ]
    },
    "anything": {
        "sentence": [
            "Is there anything else I can help you with for the party?",
            "关于派对，还有什么我可以帮你的吗？"
        ]
    },
    "apple": {
        "sentence": [
            "I have an apple and a glass of warm milk for breakfast.",
            "我早餐吃一个苹果并喝一杯温牛奶。"
        ]
    },
    "April": {
        "sentence": [
            "April is the fourth month and the flowers begin to bloom.",
            "四月是第四个月，花儿开始绽放。"
        ]
    },
    "arm": {
        "sentence": [
            "He hurt his left arm while he was playing basketball yesterday.",
            "昨天打篮球时他伤到了左胳膊。"
        ]
    },
    "around": {
        "sentence": [
            "Let's sit around the table and enjoy our delicious dinner.",
            "让我们围坐在桌旁享受我们的美味晚餐。"
        ]
    },
    "at": {
        "sentence": [
            "I usually arrive at the school gate at half past seven.",
            "我通常在七点半到达校门口。"
        ]
    },
    "at school": {
        "sentence": [
            "We learn many interesting lessons and make friends at school.",
            "我们在学校学习许多有趣的课程并交朋友。"
        ]
    },
    "at the weekend": {
        "sentence": [
            "My family often goes to the park or cinema at the weekend.",
            "我的家人在周末经常去公园或电影院。"
        ]
    },
    "August": {
        "sentence": [
            "August is the eighth month and the weather is usually very hot.",
            "八月是第八个月，天气通常非常热。"
        ]
    },
    "autumn": {
        "sentence": [
            "Autumn is a beautiful season with golden leaves on the trees.",
            "秋天是一个美丽的季节，树上有金色的叶子。"
        ]
    },
    "back": {
        "sentence": [
            "He came back home late because of the heavy traffic jam.",
            "因为交通拥堵，他很晚才回到家。"
        ]
    },
    "bad": {
        "sentence": [
            "Eating too much candy is bad for your teeth and health.",
            "吃太多糖对你的牙齿和健康有害。"
        ]
    },
    "banana": {
        "sentence": [
            "The monkey is eating a yellow banana on the tall tree.",
            "猴子正在高树上吃一根黄香蕉。"
        ]
    },
    "be": {
        "sentence": [
            "I want to be a famous singer and perform all over the world.",
            "我想成为一名著名的歌手并在全世界演出。"
        ]
    },
    "be from": {
        "sentence": [
            "Where are you from? I am from a small city in China.",
            "你来自哪里？我来自中国的一个小城市。"
        ]
    },
    "be good at": {
        "sentence": [
            "She is very good at playing the piano and likes music a lot.",
            "她非常擅长弹钢琴，并且非常喜欢音乐。"
        ]
    },
    "beautiful": {
        "sentence": [
            "There are many beautiful flowers in our school garden now.",
            "现在我们学校的花园里有许多美丽的花。"
        ]
    },
    "because": {
        "sentence": [
            "I was late for school because I missed the first bus today.",
            "我上学迟到了，因为今天我没赶上第一班公交。"
        ]
    },
    "beef": {
        "sentence": [
            "My father likes eating beef noodles for lunch on weekends.",
            "我爸爸喜欢在周末午餐时吃牛肉面。"
        ]
    },
    "behind": {
        "sentence": [
            "There is a small desk behind the door in my room.",
            "我房间的门后有一张小书桌。"
        ]
    },
    "best": {
        "sentence": [
            "He is my best friend and we often do our homework together.",
            "他是我最好的朋友，我们经常一起做作业。"
        ]
    },
    "big": {
        "sentence": [
            "The elephant is a very big animal with a long nose.",
            "大象是有着长鼻子的非常大的动物。"
        ]
    },
    "bike": {
        "sentence": [
            "I often go to school by bike to enjoy the fresh air.",
            "我经常骑自行车上学以享受新鲜空气。"
        ]
    },
    "bird": {
        "sentence": [
            "Look! A beautiful bird is singing on the tree outside.",
            "看！一只美丽的鸟正在外面的树上唱歌。"
        ]
    },
    "birthday": {
        "sentence": [
            "My birthday is in June and I will have a big party then.",
            "我的生日在六月，到时我会办一个大派对。"
        ]
    },
    "black": {
        "sentence": [
            "He is wearing a black T-shirt and a pair of blue trousers.",
            "他穿着一件黑色的T恤和一条蓝色的裤子。"
        ]
    },
    "blackboard": {
        "sentence": [
            "The teacher wrote the news on the blackboard for us to read.",
            "老师在黑板上写下了这条新闻供我们阅读。"
        ]
    },
    "blue": {
        "sentence": [
            "The sky is very blue and clear on a sunny and bright day.",
            "在晴朗明媚的日子里，天空非常蓝且清澈。"
        ]
    },
    "body": {
        "sentence": [
            "Doing more exercise is very good for your body and health.",
            "多做运动对你的身体和健康非常有益。"
        ]
    },
    "book": {
        "sentence": [
            "I like reading books about space and wild animals.",
            "我喜欢读关于太空和野生动物的书。"
        ]
    },
    "box": {
        "sentence": [
            "Please put your old toys into this small wooden box.",
            "请把你的旧玩具放进这个小木箱里。"
        ]
    },
    "boy": {
        "sentence": [
            "The tall boy standing near the library is my cousin, Tom.",
            "站在图书馆附近的那个高个子男孩是我的表弟汤姆。"
        ]
    },
    "bread": {
        "sentence": [
            "I usually have some bread and an egg for my breakfast.",
            "我早餐通常吃一些面包和一个鸡蛋。"
        ]
    },
    "bright": {
        "sentence": [
            "The stars are very bright in the dark and clear night sky.",
            "在黑暗晴朗的夜空中，星星非常明亮。"
        ]
    },
    "brother": {
        "sentence": [
            "My older brother is a student at a local college now.",
            "我哥哥现在是当地学院的一名学生。"
        ]
    },
    "building": {
        "sentence": [
            "There are many tall and modern buildings in the big city.",
            "大城市里有许多高大现代的建筑物。"
        ]
    },
    "bus": {
        "sentence": [
            "We will take a bus to the museum next Saturday morning.",
            "下周六早晨我们将坐公交车去博物馆。"
        ]
    },
    "busy": {
        "sentence": [
            "My father is very busy with his work, but he still plays with me.",
            "我父亲工作很忙，但他仍然陪我玩。"
        ]
    },
    "but": {
        "sentence": [
            "I like playing football, but I am not very good at it.",
            "我喜欢踢足球，但我不是很擅长。"
        ]
    },
    "buy": {
        "sentence": [
            "My mother bought a new and beautiful dress for me yesterday.",
            "我妈妈昨天为我买了一件漂亮的新裙子。"
        ]
    },
    "cake": {
        "sentence": [
            "We had a large and delicious cake for my birthday party.",
            "我生日聚会时，我们吃了一个又大又好吃的蛋糕。"
        ]
    },
    "call": {
        "sentence": [
            "Can you call me when you reach the airport, please?",
            "你到达机场时能给我打个电话吗？"
        ]
    },
    "can": {
        "sentence": [
            "I can speak English well after a year of practice.",
            "练习一年后，我能说好英语了。"
        ]
    },
    "candy": {
        "sentence": [
            "Children like eating sweet candy, but it is bad for teeth.",
            "孩子喜欢吃甜糖果，但这对牙齿不好。"
        ]
    },
    "capital": {
        "sentence": [
            "Beijing is the capital of China and a very big city.",
            "北京是中国的首都，也是一个非常大的城市。"
        ]
    },
    "car": {
        "sentence": [
            "My father drives a white car to work every day.",
            "我父亲每天开一辆白色的车去上班。"
        ]
    },
    "carrot": {
        "sentence": [
            "Rabbits like to eat fresh carrots and live in the garden.",
            "兔子喜欢吃新鲜胡萝卜，生活在花园里。"
        ]
    },
    "cat": {
        "sentence": [
            "My grandmother has a small white cat with long fur.",
            "我祖母有一只留着长毛的小白猫。"
        ]
    },
    "chair": {
        "sentence": [
            "Please take a chair and wait for the teacher to come.",
            "请搬把椅子坐下，等候老师过来。"
        ]
    },
    "chicken": {
        "sentence": [
            "We had some chicken and vegetables for dinner yesterday.",
            "昨天我们晚饭吃了一些鸡肉和蔬菜。"
        ]
    },
    "China": {
        "sentence": [
            "China is a great country with a long and interesting history.",
            "中国是一个拥有悠久有趣历史的伟大国家。"
        ]
    },
    "Chinese": {
        "sentence": [
            "Chinese people are very friendly and like to drink tea.",
            "中国人非常友好，而且喜欢喝茶。"
        ]
    },
    "chocolate": {
        "sentence": [
            "I like eating chocolate, but I shouldn't eat too much.",
            "我喜欢吃巧克力，但我不该吃太多。"
        ]
    },
    "choose": {
        "sentence": [
            "You can choose your favourite book from the library shelf.",
            "你可以从图书馆书架上选择你最喜欢的书。"
        ]
    },
    "Christmas": {
        "sentence": [
            "People decorate their houses with many lights on Christmas.",
            "圣诞节时，人们用许多灯装饰他们的房子。"
        ]
    },
    "cinema": {
        "sentence": [
            "Let's go to the cinema to watch an exciting movie tonight.",
            "让我们今晚去电影院看场精彩的电影吧。"
        ]
    },
    "city": {
        "sentence": [
            "I live in a peaceful city with many trees and parks.",
            "我住在一个有着许多树木和公园的宁静城市。"
        ]
    },
    "class": {
        "sentence": [
            "There are fifty students in our class from different towns.",
            "我们班有五十名来自不同城镇的学生。"
        ]
    },
    "classmate": {
        "sentence": [
            "I often play football with my classmates after school.",
            "我经常在放学后和同学们一起踢足球。"
        ]
    },
    "clean": {
        "sentence": [
            "You should keep your room clean and tidy every day.",
            "你应该每天保持房间干净整洁。"
        ]
    },
    "clothes": {
        "sentence": [
            "Put on your warm clothes because it's cold outside.",
            "穿上你暖和的衣服，因为外面很冷。"
        ]
    },
    "coffee": {
        "sentence": [
            "My father likes to drink a cup of coffee every morning.",
            "我父亲喜欢每天早晨喝一杯咖啡。"
        ]
    },
    "cola": {
        "sentence": [
            "Don't drink too much cola; it is not good for your health.",
            "别喝太多可乐；这对你的健康不好。"
        ]
    },
    "cold": {
        "sentence": [
            "The weather becomes very cold in winter, especially at night.",
            "冬天天气变得非常冷，尤其是晚上。"
        ]
    },
    "colour": {
        "sentence": [
            "What is your favourite colour? Mine is sky blue.",
            "你最喜欢的颜色是什么？我最喜欢的是天蓝色。"
        ]
    },
    "come": {
        "sentence": [
            "Please come to my house to celebrate my birthday this Sunday.",
            "请本周日来我家庆祝我的生日。"
        ]
    },
    "computer Game": {
        "sentence": [
            "Don't spend too much time playing computer games on weekends.",
            "周末不要花太多时间玩电脑游戏。"
        ]
    },
    "computer": {
        "sentence": [
            "I use the computer to look up information for my science project.",
            "我用电脑为我的科学项目查找信息。"
        ]
    },
    "cook": {
        "sentence": [
            "My mother cooks delicious and healthy food for us every day.",
            "我妈妈每天为我们做美味健康的食物。"
        ]
    },
    "cool": {
        "sentence": [
            "The weather is becoming cool and pleasant in the early autumn.",
            "初秋天气正变得凉爽宜人。"
        ]
    },
    "cousin": {
        "sentence": [
            "My cousin will visit us during the next summer holiday.",
            "我表弟将在下个暑假来看望我们。"
        ]
    },
    "dad": {
        "sentence": [
            "My dad is a doctor and he works very hard in the hospital.",
            "我爸爸是一名医生，他在医院工作非常努力。"
        ]
    },
    "dance": {
        "sentence": [
            "The little girls are learning how to dance in the music club.",
            "小女孩们正在音乐俱乐部学习跳舞。"
        ]
    },
    "danger": {
        "sentence": [
            "Wild animals are in danger because their natural homes are lost.",
            "野生动物由于天然家园的丧失正处于危险之中。"
        ]
    },
    "date": {
        "sentence": [
            "What is the date today? It is Friday, October twelfth.",
            "今天几号？今天是十月十二日，星期五。"
        ]
    },
    "daughter": {
        "sentence": [
            "She is the only daughter in her family and is very clever.",
            "她是家里唯一的女儿，非常聪明。"
        ]
    },
    "day": {
        "sentence": [
            "There are twenty-four hours in a day and seven days in a week.",
            "一天有二十四小时，一周有七天。"
        ]
    },
    "dear": {
        "sentence": [
            "Dear friends, I hope you all have a wonderful holiday.",
            "亲爱的朋友们，我希望你们都有一个美妙的假期。"
        ]
    },
    "December": {
        "sentence": [
            "December is the last month of the year and it is often snowy.",
            "十二月是一年中的最后一月，而且经常下雪。"
        ]
    },
    "desk": {
        "sentence": [
            "Please put your English textbook on the desk and listen to me.",
            "请把你的英语课本放在桌子上听我说。"
        ]
    },
    "dictionary": {
        "sentence": [
            "You should use a dictionary to look up new English words.",
            "你应该用词典来查找英语生词。"
        ]
    },
    "different": {
        "sentence": [
            "We learn many different subjects like maths and music at school.",
            "我们在学校学习数学和音乐等许多不同的科目。"
        ]
    },
    "dinner": {
        "sentence": [
            "I usually have dinner with my parents at seven every night.",
            "我通常每晚七点和父母一起吃晚饭。"
        ]
    },
    "do": {
        "sentence": [
            "What do you usually do on Saturday afternoons? I play football.",
            "你周六下午通常做什么？我踢足球。"
        ]
    },
    "dog": {
        "sentence": [
            "My neighbor has a small brown dog that likes running around.",
            "我邻居有一只喜欢到处乱跑的小棕狗。"
        ]
    },
    "door": {
        "sentence": [
            "Please close the door quietly when you leave the classroom.",
            "离开教室时请轻轻关门。"
        ]
    },
    "draw": {
        "sentence": [
            "The little boy likes to draw pictures of animals in his notebook.",
            "那个小男孩喜欢在笔记本上画动物。"
        ]
    },
    "drink": {
        "sentence": [
            "We should drink plenty of fresh water to stay healthy.",
            "我们应该喝充足的新鲜水以保持健康。"
        ]
    },
    "driver": {
        "sentence": [
            "The bus driver is very friendly and always says hello to us.",
            "公交司机非常友好，总是向我们打招呼。"
        ]
    },
    "duck": {
        "sentence": [
            "There are some white ducks swimming in the small pond now.",
            "现在有一些白鸭正在小池塘里游泳。"
        ]
    },
    "during": {
        "sentence": [
            "We visited many museums during our last summer holiday in Beijing.",
            "上次在北京过暑假期间我们参观了许多博物馆。"
        ]
    },
    "each": {
        "sentence": [
            "Each student in our class has a new school uniform.",
            "我们班每个学生都有一套新校服。"
        ]
    },
    "early": {
        "sentence": [
            "He usually gets up early to go for a run in the park.",
            "他通常起得很早去公园跑步。"
        ]
    },
    "eat": {
        "sentence": [
            "Pandas like to eat fresh bamboo and live in the forest.",
            "熊猫喜欢吃新鲜竹子且生活在森林里。"
        ]
    },
    "egg": {
        "sentence": [
            "I have a boiled egg and some bread for breakfast every morning.",
            "我每天早晨早餐吃一个煮蛋和一些面包。"
        ]
    },
    "eighty": {
        "sentence": [
            "There are eighty students in the music club this year.",
            "今年音乐俱乐部有八十名学生。"
        ]
    },
    "elephant": {
        "sentence": [
            "The elephant is the largest animal living on the land.",
            "象是陆地上生活的最大的动物。"
        ]
    },
    "email": {
        "sentence": [
            "I sent an email to my friend in England yesterday afternoon.",
            "昨天下午我给我在英国的朋友发了一封电子邮件。"
        ]
    },
    "English": {
        "sentence": [
            "English is a very important language used all over the world.",
            "英语是一门风靡全世界的重要语言。"
        ]
    },
    "enjoy": {
        "sentence": [
            "I hope you will enjoy your stay in our beautiful city.",
            "希望你在我们这座美丽的城市度过愉快的时光。"
        ]
    },
    "every": {
        "sentence": [
            "Every morning, he reads English for half an hour.",
            "每天早晨，他读半小时英语。"
        ]
    },
    "everybody": {
        "sentence": [
            "Everybody in our class is ready for the school sports meet.",
            "我们班的每个人都为校运会做好了准备。"
        ]
    },
    "eye": {
        "sentence": [
            "Dogs have big eyes and a good sense of smell.",
            "狗有大眼睛和良好的嗅觉。"
        ]
    },
    "factory": {
        "sentence": [
            "There is a big car factory in the central part of our city.",
            "我们城市中心区域有一家大型汽车厂。"
        ]
    },
    "family": {
        "sentence": [
            "Our family usually goes to the park or library on weekends.",
            "我们全家人通常在周末去公园或图书馆。"
        ]
    },
    "farm": {
        "sentence": [
            "The farmer lives on a large farm with a lot of animals.",
            "农场主住在一个有着许多动物的大农场里。"
        ]
    },
    "fast": {
        "sentence": [
            "The high-speed train travels very fast to the next big city.",
            "高铁行驶很快，去往下一个大城市。"
        ]
    },
    "father": {
        "sentence": [
            "My father works very hard in a big company every day.",
            "我父亲每天在一家大公司工作得很努力。"
        ]
    },
    "favourite": {
        "sentence": [
            "Basketball is my favourite sport and I play it after school.",
            "篮球是我最喜欢的运动，我放学后玩它。"
        ]
    },
    "February": {
        "sentence": [
            "February is the shortest month of the year with twenty-eight days.",
            "二月是一年中最短的一个月，有二十八天。"
        ]
    },
    "feeling": {
        "sentence": [
            "Happiness is a wonderful feeling that we all want to have.",
            "幸福是我们都想拥有的美妙感觉。"
        ]
    },
    "find": {
        "sentence": [
            "Can you help me find my lost keys? I left them somewhere.",
            "你能帮我找找我丢的钥匙吗？我把它们落在某处了。"
        ]
    },
    "fine": {
        "sentence": [
            "- How are you today? - I am fine, thank you very much.",
            "—你今天怎么样？—我很好，非常感谢。"
        ]
    },
    "finish": {
        "sentence": [
            "You should finish your homework before you go out to play.",
            "出去玩之前你应该完成作业。"
        ]
    },
    "first": {
        "sentence": [
            "First finish your homework, and then you can play games.",
            "先完成作业，然后你可以玩游戏。"
        ]
    },
    "fish": {
        "sentence": [
            "There are many colorful fish swimming in the small lake.",
            "小湖里有许多彩色的鱼在游泳。"
        ]
    },
    "five": {
        "sentence": [
            "There are five students in each small group for the project.",
            "项目的每个小组有五名学生。"
        ]
    },
    "floor": {
        "sentence": [
            "Please don't throw rubbish on the floor; put it into the bin.",
            "请别把垃圾扔在地上；把它放进垃圾桶里。"
        ]
    },
    "flower": {
        "sentence": [
            "The red flower in the garden smells very sweet and nice.",
            "花园里的那朵红花闻起来非常香。"
        ]
    },
    "food": {
        "sentence": [
            "My mother usually cooks healthy and delicious food for us.",
            "我妈妈通常为我们做健康美味的食物。"
        ]
    },
    "football": {
        "sentence": [
            "Football is a popular sport and many boys like playing it.",
            "足球是一项流行的运动，许多男孩喜欢踢。"
        ]
    },
    "for": {
        "sentence": [
            "I bought a special gift for my mother's birthday last week.",
            "上周我为我妈妈的生日买了一份特别的礼物。"
        ]
    },
    "forty": {
        "sentence": [
            "There are forty students in our class from different towns.",
            "我们班有四十名来自不同城镇的学生。"
        ]
    },
    "four": {
        "sentence": [
            "There are four seasons in a year, and spring is the first.",
            "一年有四季，春天是第一季。"
        ]
    },
    "Friday": {
        "sentence": [
            "Friday is my favourite day because the weekend is coming.",
            "周五是我最喜欢的日子，因为周末就要来了。"
        ]
    },
    "friend": {
        "sentence": [
            "He is a kind boy and has many friends in the school club.",
            "他是一个善良的男孩，在学校俱乐部有很多朋友。"
        ]
    },
    "friendly": {
        "sentence": [
            "The people in the small town are very friendly to visitors.",
            "小镇上的人对游客非常友好。"
        ]
    },
    "from": {
        "sentence": [
            "I am from China and I live in a big city near the sea.",
            "我来自中国，住在大海边的一座大城市里。"
        ]
    },
    "fruit": {
        "sentence": [
            "Eating fresh fruit every day is very good for your health.",
            "每天吃新鲜水果对你的健康很有好处。"
        ]
    },
    "full": {
        "sentence": [
            "The bus was so full that I couldn't find a seat to sit.",
            "公交车太挤了，我找不到座位坐。"
        ]
    },
    "fun": {
        "sentence": [
            "Playing with my best friends in the park is a lot of fun.",
            "和最好的朋友们在公园里玩很有趣。"
        ]
    },
    "game": {
        "sentence": [
            "My favorite game is hide-and-seek and we play it in the yard.",
            "我最喜欢的游戏是捉迷藏，我们在院子里玩它。"
        ]
    },
    "garden": {
        "sentence": [
            "Our school has a beautiful garden with many tall trees.",
            "我们学校有一个长着许多高树的美丽花园。"
        ]
    },
    "get": {
        "sentence": [
            "Can you help me get some water from the kitchen, please?",
            "请帮我从厨房拿点水来好吗？"
        ]
    },
    "gift": {
        "sentence": [
            "I received a beautiful book as a gift for my birthday.",
            "我收到一本精美的书作为生日礼物。"
        ]
    },
    "giraffe": {
        "sentence": [
            "The giraffe is a tall animal with a very long neck.",
            "长颈鹿是一种有着长脖子的高大动物。"
        ]
    },
    "girl": {
        "sentence": [
            "The little girl is a clever student in our English class.",
            "那个小女孩是我们英语课上一个聪明的学生。"
        ]
    },
    "give": {
        "sentence": [
            "Please give this letter to your English teacher tomorrow morning.",
            "请明天早晨把这封信交给你的英语老师。"
        ]
    },
    "glass": {
        "sentence": [
            "The window is made of glass, so be careful not to break it.",
            "窗户是玻璃做的，所以小心别打碎它。"
        ]
    },
    "go": {
        "sentence": [
            "We usually go to the library to study on Saturday afternoons.",
            "我们通常在周六下午去图书馆学习。"
        ]
    },
    "good": {
        "sentence": [
            "It is a good habit to read English for thirty minutes every day.",
            "每天读三十分钟英语是一个好习惯。"
        ]
    },
    "grade": {
        "sentence": [
            "I am in Grade Seven and my sister is in Grade Nine.",
            "我在七年级，我姐姐在九年级。"
        ]
    },
    "grandad": {
        "sentence": [
            "My grandad likes to take a walk in the park after dinner.",
            "我爷爷喜欢晚饭后去公园散步。"
        ]
    },
    "grandma": {
        "sentence": [
            "My grandma is very kind and often cooks delicious food for me.",
            "我奶奶人很好，经常给我做好吃的。"
        ]
    },
    "grandfather": {
        "sentence": [
            "My grandfather has a lot of interesting stories about the past.",
            "我祖父有很多关于过去的有趣故事。"
        ]
    },
    "grandmother": {
        "sentence": [
            "I visit my grandmother in the countryside during every holiday.",
            "每个假期我都会去乡下看望我的祖母。"
        ]
    },
    "grandparent": {
        "sentence": [
            "My grandparents live in a small but peaceful village near the sea.",
            "我祖父母住在一个靠近大海的宁静小村庄里。"
        ]
    },
    "grape": {
        "sentence": [
            "The grapes in the garden are sweet and juicy in autumn.",
            "秋天花园里的葡萄又甜又多汁。"
        ]
    },
    "grass": {
        "sentence": [
            "The children are playing happily on the green grass now.",
            "孩子们现在正在绿草地上开心地玩耍。"
        ]
    },
    "great": {
        "sentence": [
            "We had a great time during our trip to the Great Wall.",
            "在长城之行中我们度过了一段美好的时光。"
        ]
    },
    "green": {
        "sentence": [
            "Green is my favourite colour because it is like nature.",
            "绿色是我最喜欢的颜色，因为它像大自然。"
        ]
    },
    "grey": {
        "sentence": [
            "The sky is grey and cloudy, so it might rain later.",
            "天阴沉沉的，所以等下可能会下雨。"
        ]
    },
    "ground": {
        "sentence": [
            "There are many yellow leaves on the ground in early autumn.",
            "初秋地上有很多黄叶。"
        ]
    },
    "group": {
        "sentence": [
            "We worked in a group to finish our science project together.",
            "我们小组合作一起完成了科学项目。"
        ]
    },
    "habit": {
        "sentence": [
            "Eating breakfast every morning is a very healthy habit.",
            "每天早晨吃早餐是一个非常健康的习惯。"
        ]
    },
    "hair": {
        "sentence": [
            "She has long black hair and big blue eyes, very cute.",
            "她留着黑色长发，有着大大的蓝眼睛，非常可爱。"
        ]
    },
    "half": {
        "sentence": [
            "It's half past eight; we have only ten minutes for class.",
            "现在是八点半；我们离上课只有十分钟了。"
        ]
    },
    "hand": {
        "sentence": [
            "Please raise your hand if you want to ask a question.",
            "如果你想提问，请举手。"
        ]
    },
    "happy": {
        "sentence": [
            "I felt very happy when I received your beautiful gift.",
            "当我收到你精美的礼物时，我感到非常开心。"
        ]
    },
    "hard": {
        "sentence": [
            "He worked very hard and passed the difficult math test.",
            "他学习非常努力，通过了那场很难的数学测试。"
        ]
    },
    "hat": {
        "sentence": [
            "He often wears a red hat to protect himself from the sun.",
            "他经常戴着一顶红帽子来防晒。"
        ]
    },
    "have": {
        "sentence": [
            "I have a big family and we often go to the park.",
            "我有一个大家庭，我们经常去公园。"
        ]
    },
    "head": {
        "sentence": [
            "The tall boy hit his head against the door just now.",
            "那个高个子男孩刚才头撞在了门上。"
        ]
    },
    "healthy": {
        "sentence": [
            "Eating more vegetables and fruit is good for a healthy life.",
            "多吃蔬果有利于健康生活。"
        ]
    },
    "hear": {
        "sentence": [
            "I can hear someone singing in the room next door.",
            "我可以听到有人在隔壁房间唱歌。"
        ]
    },
    "heavy": {
        "sentence": [
            "The box is too heavy for the little boy to lift up.",
            "箱子太重了，小男孩搬不起来。"
        ]
    },
    "hello": {
        "sentence": [
            "Hello! My name is Tom and I am a new student here.",
            "你好！我叫汤姆，是这里的新学生。"
        ]
    },
    "help": {
        "sentence": [
            "Can you help me with my English homework this evening?",
            "今晚你能帮我做英语作业吗？"
        ]
    },
    "her": {
        "sentence": [
            "Her dream is to become a famous teacher in the future.",
            "她的梦想是将来成为一名著名的老师。"
        ]
    },
    "here": {
        "sentence": [
            "Wait for me here; I will be back in five minutes.",
            "在这里等我；我五分钟后就回来。"
        ]
    },
    "hi": {
        "sentence": [
            "Hi! How are you today? I am fine, thank you.",
            "嗨！你今天怎么样？我很好，谢谢。"
        ]
    },
    "history": {
        "sentence": [
            "History is an interesting subject about the people and the past.",
            "历史是关于人民和过去的一门有趣的学科。"
        ]
    },
    "holiday": {
        "sentence": [
            "What are you going to do during the next winter holiday?",
            "下个寒假你打算做什么？"
        ]
    },
    "home": {
        "sentence": [
            "I usually go home immediately after school to do homework.",
            "我通常放学后立即回家做作业。"
        ]
    },
    "homework": {
        "sentence": [
            "I usually finish my homework before I watch TV on Friday.",
            "周五看电视前我通常先完成作业。"
        ]
    },
    "horse": {
        "sentence": [
            "The farmer has a white horse on his large farm now.",
            "农场主在他的大农场里有一匹白马。"
        ]
    },
    "hospital": {
        "sentence": [
            "My mother works as a doctor in a local city hospital.",
            "我妈妈在当地一家城市医院当医生。"
        ]
    },
    "hot": {
        "sentence": [
            "It is very hot in summer, so we like going swimming.",
            "夏天很热，所以我们喜欢去游泳。"
        ]
    },
    "hotel": {
        "sentence": [
            "We stayed in a small hotel near the old and quiet library.",
            "我们住在一家离古老宁静的图书馆不远的小旅馆。"
        ]
    },
    "how many": {
        "sentence": [
            "How many students are there in your English class? Fifty.",
            "你们英语班有多少名学生？五十名。"
        ]
    },
    "how": {
        "sentence": [
            "How do you usually get to school every morning? By bus.",
            "你每天早晨通常怎么上学？坐公交车。"
        ]
    },
    "hundred": {
        "sentence": [
            "There are about three hundred people in the stadium now.",
            "现在体育场里大约有三百人。"
        ]
    },
    "hungry": {
        "sentence": [
            "I am very hungry; let's have lunch as soon as possible.",
            "我很饿；让我们尽快吃午饭吧。"
        ]
    },
    "hurry": {
        "sentence": [
            "Hurry up! We are going to be late for the school meeting.",
            "快点！我们学校会议要迟到了。"
        ]
    },
    "ice cream": {
        "sentence": [
            "I like eating sweet ice cream on a hot summer afternoon.",
            "我喜欢在炎热的夏天下午吃甜冰淇淋。"
        ]
    },
    "idea": {
        "sentence": [
            "That's a great idea! Let's go to the museum this Sunday.",
            "那是个好主意！这周日我们去博物馆吧。"
        ]
    },
    "important": {
        "sentence": [
            "Learning English is very important for our future work.",
            "学习英语对我们未来的工作非常重要。"
        ]
    },
    "in front of": {
        "sentence": [
            "Wait for me in front of the school gate at four o'clock.",
            "四点钟在校门口等我。"
        ]
    },
    "in": {
        "sentence": [
            "There are many books in the school library for students.",
            "学校图书馆里有很多给学生读的书。"
        ]
    },
    "interesting": {
        "sentence": [
            "The story about the magical forest is very interesting.",
            "那个关于魔法森林的故事非常有意思。"
        ]
    },
    "into": {
        "sentence": [
            "The little cat jumped into the box to hide from us.",
            "小猫跳进箱子躲着我们。"
        ]
    },
    "is": {
        "sentence": [
            "My favourite subject is English because I like talking with folks.",
            "我最喜欢的科目是英语，因为我喜欢和人交流。"
        ]
    },
    "it": {
        "sentence": [
            "I found my lost pen; it was under the small wooden table.",
            "我找到了丢的笔；它就在那个小木桌下。"
        ]
    },
    "its": {
        "sentence": [
            "The cat is cleaning its face with its small paws now.",
            "猫现在正用小爪子洗脸。"
        ]
    },
    "jacket": {
        "sentence": [
            "Put on your jacket; it's a bit cold outside this morning.",
            "穿上你的夹克；今天早晨外面有点冷。"
        ]
    },
    "January": {
        "sentence": [
            "January is the first month of the year and it's often cold.",
            "一月是一年中的第一个月，而且通常很冷。"
        ]
    },
    "Japan": {
        "sentence": [
            "Tokyo is the capital of Japan and a very big modern city.",
            "东京是日本的首都，也是一个非常大的现代化城市。"
        ]
    },
    "Japanese": {
        "sentence": [
            "My uncle likes Japanese food, especially sushi and ramen.",
            "我叔叔喜欢日本食物，尤其是寿司和拉面。"
        ]
    },
    "job": {
        "sentence": [
            "Her dream is to have an interesting job as a famous doctor.",
            "她的梦想是成为一名著名医生，拥有一份有趣的工作。"
        ]
    },
    "join": {
        "sentence": [
            "I want to join the school music club to learn the guitar.",
            "我想加入学校音乐俱乐部学习吉他。"
        ]
    },
    "juice": {
        "sentence": [
            "I usually have a glass of orange juice for my breakfast.",
            "我早餐通常喝一杯橙汁。"
        ]
    },
    "July": {
        "sentence": [
            "The summer holiday usually begins in early July every year.",
            "暑假通常在每年的七月初开始。"
        ]
    },
    "jump": {
        "sentence": [
            "The kangaroo can jump very high and far with its back legs.",
            "袋鼠后腿有力，能跳得很高很远。"
        ]
    },
    "June": {
        "sentence": [
            "Children's Day is on the first day of June in our country.",
            "在我国，儿童节在六月的第一天。"
        ]
    },
    "just": {
        "sentence": [
            "Wait a minute; I am just finishing my English homework.",
            "等一下；我正在完成英语作业。"
        ]
    },
    "kangaroo": {
        "sentence": [
            "The kangaroo is a special animal from Australia with a pouch.",
            "袋鼠是来自澳大利亚的一种有育儿袋的特殊动物。"
        ]
    },
    "keep": {
        "sentence": [
            "Please keep the classroom clean and tidy after lessons.",
            "课后请保持教室干净整洁。"
        ]
    },
    "key": {
        "sentence": [
            "He put his keys into his pocket and went out to play.",
            "他把钥匙放进兜里，出去玩了。"
        ]
    },
    "kid": {
        "sentence": [
            "The kids are playing hide-and-seek happily in the yard.",
            "孩子在大院里开心地玩捉迷藏。"
        ]
    },
    "kind": {
        "sentence": [
            "The old lady is very kind and often helps her neighbors.",
            "那位老太太人很好，经常帮助邻居。"
        ]
    },
    "kite": {
        "sentence": [
            "We flew a colorful kite in the park last Sunday afternoon.",
            "上周日下午我们在公园放了彩色风筝。"
        ]
    },
    "knee": {
        "sentence": [
            "He fell off his bike and hurt his knee yesterday afternoon.",
            "昨天下午他从自行车上摔下来，弄伤了膝盖。"
        ]
    },
    "knife": {
        "sentence": [
            "Please be careful when you use a sharp knife in the kitchen.",
            "在厨房里用锋利的刀时请务必小心。"
        ]
    },
    "know": {
        "sentence": [
            "Do you know the name of that tall boy in our class?",
            "你知道我们班那个高个子男孩的名字吗？"
        ]
    },
    "lake": {
        "sentence": [
            "We took a walk along the quiet lake after dinner yesterday.",
            "昨天晚饭后我们沿着宁静的湖边散步。"
        ]
    },
    "lamp": {
        "sentence": [
            "There is a small desk lamp on my bedside table now.",
            "我的床头柜上现在有一盏小台灯。"
        ]
    },
    "language": {
        "sentence": [
            "English is a very important language used by many people.",
            "英语是一门被许多人使用的非常重要的语言。"
        ]
    },
    "last": {
        "sentence": [
            "We went to the beach during our last summer holiday.",
            "我们在上个暑假去了海滩。"
        ]
    },
    "late": {
        "sentence": [
            "He was late for the meeting because of the traffic jam.",
            "由于交通拥堵，他开会迟到了。"
        ]
    },
    "later": {
        "sentence": [
            "I will call you back ten minutes later to discuss more.",
            "我会地十分钟后给你回电话以讨论更多内容。"
        ]
    },
    "leaf": {
        "sentence": [
            "The leaves of the trees begin to turn green in early spring.",
            "早春时节，树叶开始变绿。"
        ]
    },
    "learn": {
        "sentence": [
            "I want to learn how to cook delicious food from my mother.",
            "我想跟妈妈学习如何做美味的食物。"
        ]
    },
    "left": {
        "sentence": [
            "He wrote his name on the left corner of the small paper.",
            "他在那张小纸片的左角写下了名字。"
        ]
    },
    "leg": {
        "sentence": [
            "The strong man has very powerful legs and runs very fast.",
            "那个强壮的男人腿部很有力，跑得很快。"
        ]
    },
    "lesson": {
        "sentence": [
            "We had an interesting science lesson about space this morning.",
            "今天上午我们上了一节关于太空的有趣的科学课。"
        ]
    },
    "let": {
        "sentence": [
            "Let's go to the park to have a picnic this sunny Sunday.",
            "这个晴朗的周日，咱们去公园野餐吧。"
        ]
    },
    "letter": {
        "sentence": [
            "I received a letter from my pen friend in England yesterday.",
            "昨天我收到了英国笔友的一封信。"
        ]
    },
    "library": {
        "sentence": [
            "We often go to the school library to read books after class.",
            "课后我们经常去学校图书馆看书。"
        ]
    },
    "life": {
        "sentence": [
            "My life in the interactive school is very interesting and fun.",
            "我在互动学校的生活非常有趣。"
        ]
    },
    "like": {
        "sentence": [
            "I like reading books, especially those about space and animals.",
            "我喜欢读书，尤其是关于太空和动物的书。"
        ]
    },
    "line": {
        "sentence": [
            "Please wait in a line to get your lunch in the canteen.",
            "请排队在食堂领午餐。"
        ]
    },
    "link": {
        "sentence": [
            "The teacher shared a useful link for us to learn English.",
            "老师分享了一个有用的链接供我们学习英语。"
        ]
    },
    "lion": {
        "sentence": [
            "The lion is known as the king of the forest for its strength.",
            "狮子因其力量而被誉为森林之王。"
        ]
    },
    "list": {
        "sentence": [
            "Can you make a shopping list for the party this Sunday?",
            "你能为本周日的派对列一个购物清单吗？"
        ]
    },
    "listen": {
        "sentence": [
            "Please listen to the teacher carefully when she is talking.",
            "老师讲话时请仔细听讲。"
        ]
    },
    "listen to": {
        "sentence": [
            "I often listen to pop music while I am doing my homework.",
            "我经常在做作业时听流行音乐。"
        ]
    },
    "little": {
        "sentence": [
            "There is a little bird singing on the tree outside my room.",
            "我房间外的树上有一只小鸟在唱歌。"
        ]
    },
    "live": {
        "sentence": [
            "I live in a small but very peaceful village near the sea.",
            "我住在一个靠近大海但非常宁静的小村庄。"
        ]
    },
    "local": {
        "sentence": [
            "Our neighborhood has a local market with many fresh vegetables.",
            "我们小区有一个当地市场，那里有很多新鲜蔬菜。"
        ]
    },
    "look": {
        "sentence": [
            "Look! The birds are flying high in the blue and clear sky.",
            "看！鸟儿正在晴朗的蓝天中高高飞翔。"
        ]
    },
    "look after": {
        "sentence": [
            "Can you help me look after my dog when I am not at home?",
            "我不在家时，你能帮我照顾我的狗吗？"
        ]
    },
    "look at": {
        "sentence": [
            "Please look at the blackboard and listen to me carefully.",
            "请看黑板，并仔细听我说。"
        ]
    },
    "lot": {
        "sentence": [
            "I read a lot and have many interesting English storybooks.",
            "我读了很多书，有很多有趣的英语故事书。"
        ]
    },
    "lots of": {
        "sentence": [
            "There are lots of tall trees and colorful flowers in the park.",
            "公园里有许多高树和彩色的花。"
        ]
    },
    "love": {
        "sentence": [
            "I love my family very much and we often go to the park.",
            "我非常爱我的家人，我们经常去公园。"
        ]
    },
    "luck": {
        "sentence": [
            "I wish you good luck in your final English exam tomorrow.",
            "我祝你明天的英语期末考试好运。"
        ]
    },
    "lucky": {
        "sentence": [
            "She is very lucky to win the first prize in the competition.",
            "她很幸运能在比赛中获得一等奖。"
        ]
    },
    "lunch": {
        "sentence": [
            "We usually have lunch at twelve o'clock in the canteen.",
            "我们通常十二点在食堂吃午饭。"
        ]
    },
    "make": {
        "sentence": [
            "My mother makes delicious cakes for us on Sunday mornings.",
            "我妈妈在周日早晨为我们做美味的蛋糕。"
        ]
    },
    "man": {
        "sentence": [
            "The tall man sitting near the window is our new English teacher.",
            "坐在窗口附近的那个高个子男人是我们的新英语老师。"
        ]
    },
    "manager": {
        "sentence": [
            "My father is the manager of a big car factory in our city.",
            "我父亲是我们城市一家大汽车厂的经理。"
        ]
    },
    "many": {
        "sentence": [
            "There are many tall trees and colorful flowers in the park.",
            "公园里有许多高树和彩色的花。"
        ]
    },
    "many kinds of": {
        "sentence": [
            "There are many kinds of animals living in the large forest.",
            "茂密的森林里生活着多种动物。"
        ]
    },
    "map": {
        "sentence": [
            "There is a big map of China on the wall of our classroom.",
            "我们教室的墙上挂着一幅巨大的中国地图。"
        ]
    },
    "match": {
        "sentence": [
            "Did you watch the exciting football match on TV last night?",
            "昨晚你从电视上看那场精彩的足球赛了吗？"
        ]
    },
    "maths": {
        "sentence": [
            "Maths is an important subject and it helps us solve problems.",
            "数学是一门重要的学科，它能帮我们解决问题。"
        ]
    },
    "meat": {
        "sentence": [
            "Lions like to eat meat and they are very strong animals.",
            "狮子喜欢吃肉，它们是非常强壮的动物。"
        ]
    },
    "merry": {
        "sentence": [
            "Everyone had a merry time at the birthday party yesterday.",
            "昨天生日聚会上每个人都过得很愉快。"
        ]
    },
    "Merry Christmas": {
        "sentence": [
            "- Merry Christmas to you! - Merry Christmas, thank you very much.",
            "—祝你圣诞快乐！—圣诞快乐，非常感谢。"
        ]
    },
    "middle": {
        "sentence": [
            "Our school is in the middle of a peaceful and small town.",
            "我们的学校在一个宁静小镇的中心。"
        ]
    },
    "milk": {
        "sentence": [
            "I usually have a glass of warm milk for breakfast every day.",
            "我通常每天早餐喝一杯温牛奶。"
        ]
    },
    "minute": {
        "sentence": [
            "Wait for me for a minute; I will be ready to go out soon.",
            "等我一分钟；我很快就准备好出门了。"
        ]
    },
    "money": {
        "sentence": [
            "I saved some money to buy a special gift for my mother.",
            "我存了一些钱为我妈妈买了一份特别的礼物。"
        ]
    },
    "monkey": {
        "sentence": [
            "The monkey is jumping happily among the trees in the forest.",
            "猴子正在森林的树丛间开心地跳跃。"
        ]
    },
    "mother": {
        "sentence": [
            "My mother is a teacher and she works very hard every day.",
            "我母亲是一名老师，她每天工作都很努力。"
        ]
    },
    "mouse": {
        "sentence": [
            "The cat is running fast to catch the small grey mouse.",
            "猫正飞快地跑着去捉那只灰色的小老鼠。"
        ]
    },
    "movie": {
        "sentence": [
            "Let's go to the cinema to watch an exciting movie tonight.",
            "让我们今晚去电影院看场精彩的电影吧。"
        ]
    },
    "Ms": {
        "sentence": [
            "Ms Li is our new English teacher and she is very friendly.",
            "李女士是我们的新英语老师，她非常友好。"
        ]
    },
    "much": {
        "sentence": [
            "Thank you very much for your help with my English study.",
            "非常感谢你对我的英语学习提供的帮助。"
        ]
    },
    "mum": {
        "sentence": [
            "Mum, can I have some orange juice and a small cake, please?",
            "妈妈，我能喝点橙汁并吃个小蛋糕吗？"
        ]
    },
    "music": {
        "sentence": [
            "I like listening to music while I am doing my homework.",
            "我喜欢在做作业时听音乐。"
        ]
    },
    "near": {
        "sentence": [
            "I live in a peaceful house near the old school library.",
            "我住在一所靠近老学校图书馆的宁静房子里。"
        ]
    },
    "never": {
        "sentence": [
            "He is a hardworking student and never comes late for school.",
            "他是个努力的学生，上学从不迟到。"
        ]
    },
    "next": {
        "sentence": [
            "What are you going to do during the next summer holiday?",
            "下个暑假你打算做什么？"
        ]
    },
    "next to": {
        "sentence": [
            "The bank is right next to the big supermarket in our city.",
            "银行就在城市的大超市隔壁。"
        ]
    },
    "night": {
        "sentence": [
            "The stars are very bright in the dark and clear night sky.",
            "在黑暗晴朗的夜空中，星星非常明亮。"
        ]
    },
    "ninety": {
        "sentence": [
            "There are about ninety students in the school music club.",
            "学校音乐俱乐部大约有九十名学生。"
        ]
    },
    "noodle": {
        "sentence": [
            "My mother cooks delicious beef noodles for us every weekend.",
            "我妈妈每个周末都为我们做美味的牛肉面。"
        ]
    },
    "not": {
        "sentence": [
            "I am not a teacher; I am a student in the seventh grade.",
            "我不是老师；我是七年级的学生。"
        ]
    },
    "nurse": {
        "sentence": [
            "His mother works as a nurse in a local city hospital now.",
            "他母亲现在在当地城市医院当一名护士。"
        ]
    },
    "o'clock": {
        "sentence": [
            "I usually arrive at the school gate at seven o'clock sharp.",
            "我通常在七点整到达校门口。"
        ]
    },
    "often": {
        "sentence": [
            "We often go to the library to study on Saturday afternoons.",
            "我们经常在周六下午去图书馆学习。"
        ]
    },
    "oh": {
        "sentence": [
            "Oh! I forgot to bring my English textbook to school today.",
            "噢！我今天忘了带英语课本到学校。"
        ]
    },
    "on sale": {
        "sentence": [
            "Many beautiful clothes in that shop are on sale this week.",
            "那家店的许多漂亮衣服本周在打折。"
        ]
    },
    "on the left": {
        "sentence": [
            "The library is on the left side of the school playground.",
            "图书馆就在学校操场的左侧。"
        ]
    },
    "on the right": {
        "sentence": [
            "The bank is just on the right corner of the busy street.",
            "银行就在繁华街道的右拐角处。"
        ]
    },
    "or": {
        "sentence": [
            "Which do you prefer for lunch, beef noodles or fried rice?",
            "午饭你更喜欢哪种，牛肉面还是炒饭？"
        ]
    },
    "our": {
        "sentence": [
            "Our school has a beautiful garden with many colorful flowers.",
            "我们的学校有一个长着许多彩色花的美丽花园。"
        ]
    },
    "over there": {
        "sentence": [
            "Look! The tall boy standing over there is my cousin Tom.",
            "看！站在那边的那个高个子男孩是我的表弟汤姆。"
        ]
    },
    "panda": {
        "sentence": [
            "Pandas are famous animals from China and they like bamboo.",
            "大熊猫是来自中国的著名动物，它们喜欢竹子。"
        ]
    },
    "paper": {
        "sentence": [
            "Please write down your name and address on this piece of paper.",
            "请在这张纸上写下你的姓名和地址。"
        ]
    },
    "parent": {
        "sentence": [
            "I usually have dinner with my parents at seven every night.",
            "我通常每晚七点和父母一起吃晚饭。"
        ]
    },
    "park": {
        "sentence": [
            "My family often goes to the park for a walk on weekends.",
            "我们家人通常在周末去公园散步。"
        ]
    },
    "party": {
        "sentence": [
            "We will have a big party to celebrate my thirteenth birthday.",
            "我们将办一个大派对来庆祝我十三岁的生日。"
        ]
    },
    "PE": {
        "sentence": [
            "PE is my favourite subject because I like playing basketball.",
            "体育是我最喜欢的科目，因为我喜欢打篮球。"
        ]
    },
    "people": {
        "sentence": [
            "The people in the small town are very friendly to visitors.",
            "小镇上的人对游客非常友好。"
        ]
    },
    "photo": {
        "sentence": [
            "I took many beautiful photos during our trip to Beijing.",
            "在北京旅行期间，我拍了许多漂亮的照片。"
        ]
    },
    "picture": {
        "sentence": [
            "There is a big picture of an elephant on the classroom wall.",
            "教室墙上挂着一幅巨大的象画。"
        ]
    },
    "place": {
        "sentence": [
            "Beijing is a famous city with many interesting historical places.",
            "北京是一个有着许多有趣历史古迹的名城。"
        ]
    },
    "plant": {
        "sentence": [
            "There are many green plants and tall trees in our garden.",
            "我们的花园里有许多绿植和高树。"
        ]
    },
    "playground": {
        "sentence": [
            "The students are playing football happily on the playground.",
            "学生们正在操场上开心地踢足球。"
        ]
    },
    "police": {
        "sentence": [
            "The police station is near the shopping mall in our city.",
            "警察局就在我们城市的购物商场附近。"
        ]
    },
    "policeman": {
        "sentence": [
            "My uncle is a policeman and he works very hard every day.",
            "我叔叔是一名警察，他每天工作都很努力。"
        ]
    },
    "potato": {
        "sentence": [
            "I like eating beef with potatoes for my dinner very much.",
            "我很喜欢晚饭吃牛肉炖土豆。"
        ]
    },
    "print": {
        "sentence": [
            "Can you help me print this English article for our project?",
            "你能帮我为我们的项目打印这篇英语文章吗？"
        ]
    },
    "programme": {
        "sentence": [
            "I like watching music programmes on TV on Friday nights.",
            "我喜欢在周五晚上从电视上看音乐节目。"
        ]
    },
    "put away": {
        "sentence": [
            "Please put away your toys before you go to bed, little boy.",
            "小男孩，睡觉前请把你的玩具收起来。"
        ]
    },
    "read": {
        "sentence": [
            "I like reading books about space and interesting animals.",
            "我喜欢读关于太空和有趣动物的书。"
        ]
    },
    "rice": {
        "sentence": [
            "Most Chinese people like to eat rice for lunch and dinner.",
            "大多数中国人午饭和晚饭喜欢吃米饭。"
        ]
    },
    "right": {
        "sentence": [
            "Go straight along this road and turn right at the corner.",
            "沿着这条路直走，在拐角处向右转。"
        ]
    },
    "room": {
        "sentence": [
            "My room is small but very comfortable and always tidy.",
            "我的卧室虽然小，但非常舒适且总是很整洁。"
        ]
    },
    "run": {
        "sentence": [
            "We like to run in the park together on Sunday mornings.",
            "我们喜欢在周日早晨一起去公园跑步。"
        ]
    },
    "sale": {
        "sentence": [
            "There is a big sale in the supermarket near our school now.",
            "我们学校附近的超市现在正在大减价。"
        ]
    },
    "scarf": {
        "sentence": [
            "She wore a red silk scarf to protect herself from the wind.",
            "她系着一条红色的丝绸围巾来防风。"
        ]
    },
    "science": {
        "sentence": [
            "Science is an interesting subject about how the world works.",
            "科学是关于世界如何运作的一门有趣的学科。"
        ]
    },
    "search for": {
        "sentence": [
            "I use the computer to search for information for my project.",
            "我用电脑为我的项目搜索信息。"
        ]
    },
    "seventy": {
        "sentence": [
            "There are seventy students in the school art club this term.",
            "这学期学校艺术俱乐部有七十名学生。"
        ]
    },
    "share": {
        "sentence": [
            "It is a good habit to share your toys with other children.",
            "和其他孩子分享玩具是一个好习惯。"
        ]
    },
    "shoe": {
        "sentence": [
            "I bought a pair of new white shoes for the sports meet.",
            "我为校运会买了一双新的白鞋。"
        ]
    },
    "shop": {
        "sentence": [
            "My mother often goes to the local fruit shop on weekends.",
            "我妈妈经常在周末去当地的水果店。"
        ]
    },
    "silk": {
        "sentence": [
            "China is famous all over the world for its beautiful silk.",
            "中国以其美丽的丝绸享誉世界。"
        ]
    },
    "sing": {
        "sentence": [
            "The little girl can sing English songs very beautifully now.",
            "那个小女孩现在能把英语歌唱得非常动听。"
        ]
    },
    "sister": {
        "sentence": [
            "My older sister is a student in a city college in Beijing.",
            "我姐姐是北京一家城市学院的学生。"
        ]
    },
    "sixty": {
        "sentence": [
            "There are sixty minutes in an hour and sixty seconds in a minute.",
            "一小时有六十分钟，一分钟有六十秒。"
        ]
    },
    "sleep": {
        "sentence": [
            "Babies spend a lot of time in sleep every day and night.",
            "婴儿每天昼夜花很多时间睡觉。"
        ]
    },
    "small": {
        "sentence": [
            "I live in a small but very peaceful village near the sea.",
            "我住在一个靠近大海但非常宁静的小村庄。"
        ]
    },
    "so": {
        "sentence": [
            "It was raining, so we had to stay at home and read books.",
            "天在下雨，所以我们不得不待在家里看书。"
        ]
    },
    "some": {
        "sentence": [
            "There are some beautiful flowers in our school garden now.",
            "现在我们学校的花园里有一些美丽的花。"
        ]
    },
    "sometimes": {
        "sentence": [
            "Sometimes I go to the cinema with my best friends on Sundays.",
            "有时我周日和最好的朋友们一起去电影院。"
        ]
    },
    "song": {
        "sentence": [
            "I like this English song very much because it is cheerful.",
            "我很喜欢这首英语歌，因为它很欢快。"
        ]
    },
    "soup": {
        "sentence": [
            "I usually have a bowl of hot vegetable soup for my dinner.",
            "我晚饭通常喝一碗热蔬菜汤。"
        ]
    },
    "speak": {
        "sentence": [
            "She can speak English very well after learning it for years.",
            "学习几年之后，她英语说得很好。"
        ]
    },
    "spend": {
        "sentence": [
            "I spend about half an hour reading English every morning.",
            "我每天早晨化大约半小时读英语。"
        ]
    },
    "star": {
        "sentence": [
            "The stars are very bright in the dark and clear night sky.",
            "在黑暗晴朗的夜空中，星星非常明亮。"
        ]
    },
    "story": {
        "sentence": [
            "My grandfather has a lot of interesting stories about the past.",
            "我祖父有很多关于过去的有趣故事。"
        ]
    },
    "strong": {
        "sentence": [
            "Doing more sports can help you become strong and healthy.",
            "多做运动能帮你变得强壮和健康。"
        ]
    },
    "study": {
        "sentence": [
            "We should work hard and study to have a bright future.",
            "为了有一个美好的未来，我们应该努力学习。"
        ]
    },
    "subject": {
        "sentence": [
            "What is your favourite subject? My favourite is English.",
            "你最喜欢的科目是什么？我最喜欢的是英语。"
        ]
    },
    "such": {
        "sentence": [
            "I have never seen such a cute panda in the zoo before.",
            "以前我从未在动物园见过这么可爱的大熊猫。"
        ]
    },
    "sun": {
        "sentence": [
            "The sun rises in the east and sets in the west every day.",
            "太阳每天从东方升起，从西方落下。"
        ]
    },
    "sure": {
        "sentence": [
            "Are you sure about the result of the important math test?",
            "你确定那次重要数学测试的结果吗？"
        ]
    },
    "sweater": {
        "sentence": [
            "Put on your sweater; it is getting cold outside this evening.",
            "穿上你的毛衣；今晚外面正变冷。"
        ]
    },
    "sweep": {
        "sentence": [
            "We often sweep the classroom after school to keep it clean.",
            "放学后我们经常打扫教室以保持整洁。"
        ]
    },
    "sweep away": {
        "sentence": [
            "The workers are busy trying to sweep away the thick snow.",
            "工人们正忙着清除厚雪。"
        ]
    },
    "table": {
        "sentence": [
            "Please put the fruit and cakes on the small wooden table.",
            "请把水果和蛋糕放在那个小木桌上。"
        ]
    },
    "take": {
        "sentence": [
            "Remember to take your schoolbag when you go to school.",
            "上学时记得带上你的书包。"
        ]
    },
    "take photos": {
        "sentence": [
            "I like to take photos of beautiful flowers in the park.",
            "我喜欢在公园里拍漂亮的花的照片。"
        ]
    },
    "talk": {
        "sentence": [
            "Please don't talk loudly while the teacher is speaking now.",
            "现在老师说话时请不要大声喧哗。"
        ]
    },
    "tall": {
        "sentence": [
            "The tall boy standing near the library is my cousin Tom.",
            "站在图书馆附近的那个高个子男孩是我的表弟汤姆。"
        ]
    },
    "tea": {
        "sentence": [
            "Many Chinese people like to drink hot tea after their dinner.",
            "许多中国人晚饭后喜欢喝热茶。"
        ]
    },
    "television": {
        "sentence": [
            "We often watch football matches on television at weekends.",
            "我们经常在周末从电视上看足球赛。"
        ]
    },
    "tell": {
        "sentence": [
            "Can you tell me the way to the nearest bus station, please?",
            "你能告诉我最近的车站怎么走吗？"
        ]
    },
    "theatre": {
        "sentence": [
            "We went to a local theatre to watch a famous play yesterday.",
            "昨天我们去当地一段剧院看了一场著名的戏。"
        ]
    },
    "their": {
        "sentence": [
            "The students are doing their homework in the quiet classroom.",
            "学生们在安静的教室里写作业。"
        ]
    },
    "them": {
        "sentence": [
            "I found my lost keys; I left them on the small kitchen table.",
            "我找到了丢的钥匙；我把它们落在厨房小桌子上了。"
        ]
    },
    "then": {
        "sentence": [
            "First finish your homework, and then you can go out to play.",
            "先完成作业，然后你可以出去玩。"
        ]
    },
    "there": {
        "sentence": [
            "There are many tall trees and colorful flowers in the park.",
            "里有许多高树和彩色的花。"
        ]
    },
    "these": {
        "sentence": [
            "These new English storybooks are very interesting for kids.",
            "这些新的英语故事书对孩子来说非常有趣。"
        ]
    },
    "they": {
        "sentence": [
            "They are playing football happily on the school playground.",
            "他们正在学校操场上开心地踢足球。"
        ]
    },
    "thing": {
        "sentence": [
            "I have many things to do during this busy winter holiday.",
            "在这个繁忙的寒假期间我有很多事情要做。"
        ]
    },
    "think": {
        "sentence": [
            "I think learning English is very important for our future.",
            "我认为学习英语对我们的未来非常重要。"
        ]
    },
    "thirty": {
        "sentence": [
            "There are thirty students in each small group for the project.",
            "项目的每个小组有三十名学生。"
        ]
    },
    "those": {
        "sentence": [
            "Those red flowers in the garden smell very sweet and nice.",
            "花园里的那些红花闻起来非常香。"
        ]
    },
    "tiger": {
        "sentence": [
            "The tiger is a very strong and famous animal in the world.",
            "虎是世界上的一种非常强壮且著名的动物。"
        ]
    },
    "tired": {
        "sentence": [
            "He felt very tired after running for an hour in the park.",
            "在公园跑了一个小时后，他感到非常疲倦。"
        ]
    },
    "to": {
        "sentence": [
            "I usually walk to the school library to read books after class.",
            "课后我通常步行去学校图书馆看书。"
        ]
    },
    "tomato": {
        "sentence": [
            "My mother often cooks healthy tomato and egg soup for us.",
            "我妈妈经常为我们做健康的番茄鸡蛋汤。"
        ]
    },
    "too much": {
        "sentence": [
            "Don't eat too much candy; it is not good for your health.",
            "别吃太多糖果；这对你的健康不好。"
        ]
    },
    "tooth": {
        "sentence": [
            "Eating too much sweet candy is bad for your teeth and health.",
            "吃太多甜糖对你的牙齿和健康有害。"
        ]
    },
    "train": {
        "sentence": [
            "We will take a train to Beijing during the summer holiday.",
            "暑假期间我们将坐火车去北京。"
        ]
    },
    "travel": {
        "sentence": [
            "I hope to travel all over the world with my family one day.",
            "我希望有一天能和家人一起周游世界。"
        ]
    },
    "tree": {
        "sentence": [
            "There are many tall trees and colorful flowers in the park.",
            "公园里有许多高树和彩色的花。"
        ]
    },
    "turn": {
        "sentence": [
            "Go straight along this road and turn right at the corner.",
            "沿着这条路直走，在拐角处向右转。"
        ]
    },
    "turn on": {
        "sentence": [
            "Please turn on the light; it's getting dark inside the room.",
            "请开灯；房间里正变暗。"
        ]
    },
    "ugh": {
        "sentence": [
            "Ugh! This soup tastes very bad; please don't drink it.",
            "呃！这汤味道很差；请不要喝它。"
        ]
    },
    "uncle": {
        "sentence": [
            "My uncle works in a big city and he often visits us here.",
            "我叔叔在大城市工作，他经常来这里看我们。"
        ]
    },
    "use": {
        "sentence": [
            "We use the computer to look up information for our project.",
            "我们用电脑为我们的项目查找信息。"
        ]
    },
    "vegetable": {
        "sentence": [
            "Eating more vegetables and fruit is good for a healthy life.",
            "多吃蔬果有利于健康生活。"
        ]
    },
    "very": {
        "sentence": [
            "English is a very important language used all over the world.",
            "英语是一门在全世界都很受欢迎的重要语言。"
        ]
    },
    "visit": {
        "sentence": [
            "We decided to visit the history museum this Sunday morning.",
            "我们决定本周日早晨参观历史博物馆。"
        ]
    },
    "wait": {
        "sentence": [
            "Please wait for me at the school gate at four o'clock sharp.",
            "请四点整在校门口等我。"
        ]
    },
    "wait for": {
        "sentence": [
            "I usually wait for the school bus at the stop near my house.",
            "我通常在离我家很近的车站等校车。"
        ]
    },
    "walk": {
        "sentence": [
            "We like to walk in the park to enjoy the fresh air after dinner.",
            "我们喜欢在晚饭后去公园散步以享受新鲜空气。"
        ]
    },
    "wall": {
        "sentence": [
            "There is a big map of the world on the wall of our classroom.",
            "我们教室的墙上挂着一幅巨大的世界地图。"
        ]
    },
    "want": {
        "sentence": [
            "I want to be a famous doctor and help people in the future.",
            "我想成为一名著名的医生，将来帮助人们。"
        ]
    },
    "wash": {
        "sentence": [
            "Remember to wash your hands before you have dinner, Tom.",
            "汤姆，记得在吃晚饭前洗手。"
        ]
    },
    "watch": {
        "sentence": [
            "We like to watch football matches on TV together on weekends.",
            "我们喜欢在周末一起从电视上看足球赛。"
        ]
    },
    "water": {
        "sentence": [
            "We should drink plenty of fresh water to stay healthy.",
            "我们应该喝充足的新鲜水以保持健康。"
        ]
    },
    "we": {
        "sentence": [
            "We often go to the school library to study after class.",
            "课后我们经常去学校图书馆学习。"
        ]
    },
    "wear": {
        "sentence": [
            "He is wearing a white shirt and a pair of blue trousers today.",
            "他今天穿着一件白衬衫和一条蓝裤子。"
        ]
    },
    "week": {
        "sentence": [
            "There are seven days in a week, and Sunday is the last.",
            "一周有七天，周日是最后一天。"
        ]
    },
    "well": {
        "sentence": [
            "She can speak English very well after learning it for years.",
            "学习几年之后，她英语说得很好。"
        ]
    },
    "What about": {
        "sentence": [
            "- I like playing football. - What about you, Peter?",
            "—我喜欢踢足球。—你呢，彼得？"
        ]
    },
    "when": {
        "sentence": [
            "When did you finish your homework yesterday afternoon?",
            "昨天下午你几点完成作业的？"
        ]
    },
    "where": {
        "sentence": [
            "Where is my new English dictionary? I can't find it now.",
            "我的新英语词典在哪儿？我现在找不到它。"
        ]
    },
    "which": {
        "sentence": [
            "Which do you like better, English history or music science?",
            "你更喜欢哪一个，英语历史还是音乐科学？"
        ]
    },
    "who": {
        "sentence": [
            "Who is that tall boy standing near the library? He is Tom.",
            "站在图书馆附近的那个高个子男孩是谁？他是汤姆。"
        ]
    },
    "woman": {
        "sentence": [
            "The woman in the red dress is our new English teacher.",
            "穿红裙子的那位女士是我们的新英语老师。"
        ]
    },
    "work": {
        "sentence": [
            "My father works very hard in a big company every day.",
            "我父亲每天在一家大公司工作得很努力。"
        ]
    },
    "worker": {
        "sentence": [
            "Many workers are building a new library near our school.",
            "许多工人正在我们学校附近建一座新图书馆。"
        ]
    },
    "world": {
        "sentence": [
            "English is an important language used all over the world.",
            "英语是一门在全世界都很受欢迎的重要语言。"
        ]
    },
    "year": {
        "sentence": [
            "He is thirteen years old and lives in a big city in China.",
            "他十三岁，住在中国的一个大城市。"
        ]
    },
    "zebra": {
        "sentence": [
            "The zebra is a famous animal from Africa with black stripes.",
            "斑马是来自非洲的一种有着黑色条纹的著名动物。"
        ]
    },
    "zoo": {
        "sentence": [
            "We saw many interesting wild animals in the city zoo yesterday.",
            "昨天我们在城市动物园见到了许多有趣的野生动物。"
        ]
    },
    "a few": {
        "sentence": [
            "I have a few English books to read this weekend.",
            "这周末我有几本英语书要读。"
        ]
    },
    "a little": {
        "sentence": [
            "There is a little milk in the glass on the table.",
            "桌子上的玻璃杯里有一点牛奶。"
        ]
    },
    "a lot of": {
        "sentence": [
            "I have a lot of friends in my new middle school.",
            "在我的新中学里我有很多朋友。"
        ]
    },
    "actor": {
        "sentence": [
            "My uncle is a famous actor and he works in Beijing.",
            "我叔叔是一位著名的演员，他在北京工作。"
        ]
    },
    "also": {
        "sentence": [
            "She likes playing the piano and she also likes singing songs.",
            "她喜欢弹钢琴，也喜欢唱歌。"
        ]
    },
    "an": {
        "sentence": [
            "I usually have an apple and an egg for my breakfast.",
            "我早餐通常吃一个苹果和一个鸡蛋。"
        ]
    },
    "art": {
        "sentence": [
            "Art is an interesting subject and I like drawing very much.",
            "美术是一门有趣的学科，我非常喜欢画画。"
        ]
    },
    "as well as": {
        "sentence": [
            "He likes playing basketball as well as football after school.",
            "放学后他喜欢打篮球，也喜欢踢足球。"
        ]
    },
    "Asia": {
        "sentence": [
            "China is a great country located in the east of Asia.",
            "中国是一个位于亚洲东部的伟大国家。"
        ]
    },
    "at the moment": {
        "sentence": [
            "Mother is cooking a delicious dinner in the kitchen at the moment.",
            "妈妈此刻正在厨房里做美味的晚饭。"
        ]
    },
    "at weekends": {
        "sentence": [
            "We often go to the library to study at weekends.",
            "我们经常在周末去图书馆学习。"
        ]
    },
    "at work": {
        "sentence": [
            "My father is at work now and he will be back soon.",
            "我父亲现在正在工作，他很快就会回来。"
        ]
    },
    "aunt": {
        "sentence": [
            "My aunt is a friendly nurse in a big city hospital.",
            "我姨妈是一个大城市医院里一位友好的护士。"
        ]
    },
    "be bad for": {
        "sentence": [
            "Eating too much sweet candy is bad for your teeth.",
            "吃太多甜糖对你的牙齿有害。"
        ]
    },
    "be good for": {
        "sentence": [
            "Eating more vegetables and fruit is good for your health.",
            "多吃蔬菜和水果对你的健康有好处。"
        ]
    },
    "bean": {
        "sentence": [
            "My mother often cooks delicious green bean soup in summer.",
            "我妈妈夏天经常做美味的绿豆汤。"
        ]
    },
    "bed": {
        "sentence": [
            "I usually go to bed at nine o'clock every night.",
            "我通常每晚九点上床睡觉。"
        ]
    },
    "begin": {
        "sentence": [
            "Our first English lesson will begin at eight o'clock tomorrow.",
            "明天早晨八点开始我们的第一节英语课。"
        ]
    },
    "between": {
        "sentence": [
            "The new library is between the classroom and the playground.",
            "新图书馆在教室和操场之间。"
        ]
    },
    "bit": {
        "sentence": [
            "The weather is a bit cold today, so wear your jacket.",
            "今天天气有点冷，所以穿上你的夹克吧。"
        ]
    },
    "can't": {
        "sentence": [
            "I can't play the violin, but I can play the piano.",
            "我不会拉小提琴，但我会弹钢琴。"
        ]
    },
    "card": {
        "sentence": [
            "He sent me a beautiful birthday card yesterday morning.",
            "昨天早晨他寄给我一张精美的生日卡。"
        ]
    },
    "catch": {
        "sentence": [
            "Hurry up! We need to catch the early bus to school.",
            "快点！我们需要赶早班公交去上学。"
        ]
    },
    "CD": {
        "sentence": [
            "I often listen to English songs on this old CD player.",
            "我经常用这个旧CD播放机听英语歌。"
        ]
    },
    "child": {
        "sentence": [
            "The little child is playing with a toy car in the yard.",
            "那个小孩正在院子里玩玩具车。"
        ]
    },
    "coat": {
        "sentence": [
            "Put on your warm coat because it is cold outside now.",
            "穿上你暖和的外套，因为现在外面很冷。"
        ]
    },
    "come from": {
        "sentence": [
            "Where do these beautiful flowers come from? From the garden.",
            "这些漂亮的花来自哪里？来自花园。"
        ]
    },
    "company": {
        "sentence": [
            "My father works very hard in a big computer company.",
            "我父亲在一家大型电脑公司工作非常努力。"
        ]
    },
    "cut": {
        "sentence": [
            "Be careful not to cut your finger with the sharp knife.",
            "小心别用锋利的刀割到手指。"
        ]
    },
    "cute": {
        "sentence": [
            "The small panda is very cute and everyone likes it.",
            "那只小熊猫非常可爱，每个人都喜欢它。"
        ]
    },
    "difficult": {
        "sentence": [
            "The math problem is very difficult for the little boy.",
            "那道数学题对那个小男孩来说非常难。"
        ]
    },
    "document": {
        "sentence": [
            "Please help me print this important document for the meeting.",
            "请帮我为会议打印这份重要的文档。"
        ]
    },
    "dress": {
        "sentence": [
            "She is wearing a beautiful red dress for the school party.",
            "她穿着一件漂亮的红裙子去参加学校派对。"
        ]
    },
    "England": {
        "sentence": [
            "London is the capital of England and a very big city.",
            "伦敦是英国的首都，也是一个非常大的城市。"
        ]
    },
    "Europe": {
        "sentence": [
            "He visited many interesting countries in Europe last summer holiday.",
            "去年暑假期间他参观了欧洲许多有趣的国家。"
        ]
    },
    "evening": {
        "sentence": [
            "I usually do my homework in the evening before dinner.",
            "我通常在晚上晚饭前做作业。"
        ]
    },
    "farmer": {
        "sentence": [
            "The farmer is working hard on his large farm now.",
            "农场主现在正在他的大农场里努力工作。"
        ]
    },
    "fifty": {
        "sentence": [
            "There are about fifty students in our school music club.",
            "我们学校音乐俱乐部大约有五十名学生。"
        ]
    },
    "film": {
        "sentence": [
            "We went to the cinema to watch an exciting film yesterday.",
            "昨天我们去电影院看了一部精彩的电影。"
        ]
    },
    "first name": {
        "sentence": [
            "What is your first name? My first name is Peter.",
            "你叫什么名字？我的名字是彼得。"
        ]
    },
    "front": {
        "sentence": [
            "There is a tall tree in front of our classroom.",
            "我们教室前面有一棵高树。"
        ]
    },
    "furniture": {
        "sentence": [
            "My parents bought some new furniture for our new house.",
            "我父母为我们的新房子买了一些新家具。"
        ]
    },
    "get fat": {
        "sentence": [
            "If you eat too much chocolate, you might get fat.",
            "如果你吃太多巧克力，你可能会变胖。"
        ]
    },
    "get off": {
        "sentence": [
            "Remember to get off the bus at the next station.",
            "记得在下一站下车。"
        ]
    },
    "get ready for": {
        "sentence": [
            "Every student is getting ready for the school sports meet.",
            "每个学生都在为校运会做准备。"
        ]
    },
    "get up": {
        "sentence": [
            "He usually gets up early to go for a run in the park.",
            "他通常起得很早去公园跑步。"
        ]
    },
    "go back": {
        "sentence": [
            "I need to go back home to get my English book.",
            "我需要回家去拿我的英语书。"
        ]
    },
    "go home": {
        "sentence": [
            "I usually go home immediately after the football match.",
            "足球赛结束后我通常立即回家。"
        ]
    },
    "go shopping": {
        "sentence": [
            "My mother often goes shopping in the supermarket on Sundays.",
            "我妈妈经常在周日去超市购物。"
        ]
    },
    "go to bed": {
        "sentence": [
            "It is a good habit to go to bed early every night.",
            "每天早睡是一个好习惯。"
        ]
    },
    "go to school": {
        "sentence": [
            "I go to school by bike every morning to exercise.",
            "我每天早晨骑自行车上学以锻炼身体。"
        ]
    },
    "go to sleep": {
        "sentence": [
            "The little baby usually goes to sleep at eight o'clock.",
            "那个小宝宝通常在八点钟入睡。"
        ]
    },
    "grandpa": {
        "sentence": [
            "My grandpa likes to sit in the garden and read newspapers.",
            "我爷爷喜欢坐在花园里看报纸。"
        ]
    },
    "ha ha": {
        "sentence": [
            "Ha ha! That is a very funny story you just told us.",
            "哈哈！你刚才讲的那个故事非常有趣。"
        ]
    },
    "hall": {
        "sentence": [
            "The school meeting will be held in the big school hall.",
            "学校会议将在学校大礼堂举行。"
        ]
    },
    "has": {
        "sentence": [
            "He has a new schoolbag and two interesting storybooks.",
            "他有一个新书包和两本有趣的故事书。"
        ]
    },
    "have breakfast": {
        "sentence": [
            "I usually have breakfast with my parents at seven o'clock.",
            "我通常在七点和父母一起吃早饭。"
        ]
    },
    "have dinner": {
        "sentence": [
            "Our family usually has dinner together at seven every night.",
            "我们全家人通常在每晚七点一起吃晚饭。"
        ]
    },
    "have got": {
        "sentence": [
            "I have got a new dictionary and it is very useful.",
            "我得到了一本新字典，它非常有用。"
        ]
    },
    "have lunch": {
        "sentence": [
            "We usually have lunch in the school canteen at twelve.",
            "我们通常十二点在学校食堂吃午饭。"
        ]
    },
    "he": {
        "sentence": [
            "He is a kind boy and he likes helping his classmates.",
            "他是一个善良的男孩，他喜欢帮助同学。"
        ]
    },
    "hear from": {
        "sentence": [
            "I hope to hear from my pen friend in England soon.",
            "我希望很快能收到英国笔友的信。"
        ]
    },
    "him": {
        "sentence": [
            "I saw him playing football on the playground just now.",
            "我刚才看见他在操场上踢足球。"
        ]
    },
    "hot dog": {
        "sentence": [
            "I like eating hot dogs with a lot of heavy sauce.",
            "我喜欢吃加了很多厚酱汁的热狗。"
        ]
    },
    "house": {
        "sentence": [
            "My family moved to a small but peaceful house last month.",
            "上个月我们全家搬到了一所虽小但很宁静的房子里。"
        ]
    },
    "How about...": {
        "sentence": [
            "I like reading books. How about you, my dear friend?",
            "我喜欢读书。你呢，我亲爱的朋友？"
        ]
    },
    "hurry up": {
        "sentence": [
            "Hurry up! The first English lesson will begin in five minutes.",
            "快点！第一节英语课五分钟后就开始了。"
        ]
    },
    "I'm afraid": {
        "sentence": [
            "I'm afraid I can't go to your party this Sunday afternoon.",
            "恐怕这周日下午我不能去参加你的派对。"
        ]
    },
    "information": {
        "sentence": [
            "I use the computer to look up information for my project.",
            "我用电脑为我的项目查找信息。"
        ]
    },
    "Internet": {
        "sentence": [
            "The Internet is very useful for us to learn new things.",
            "互联网对我们学习新事物非常有用。"
        ]
    },
    "IT": {
        "sentence": [
            "IT is an interesting subject about computers and technology.",
            "信息技术是一门关于计算机和技术的有趣的学科。"
        ]
    },
    "keyboard": {
        "sentence": [
            "Please be careful when you use the new computer keyboard.",
            "使用新电脑键盘时请小心。"
        ]
    },
    "kilo": {
        "sentence": [
            "My mother bought two kilos of fresh apples in the market.",
            "我妈妈在市场里买了两公斤新鲜苹果。"
        ]
    },
    "kitchen": {
        "sentence": [
            "Mother is busy cooking delicious food in the kitchen now.",
            "妈妈现在正忙着在厨房里做美味的食物。"
        ]
    },
    "last name": {
        "sentence": [
            "What is your last name? My last name is Green.",
            "你姓什么？我姓格林。"
        ]
    }
}