{
    "direct": {
        "sentence": [
            "Can you direct me to the nearest bookstore, please?",
            "请问你能告诉我最近的书店怎么走吗？"
        ]
    },
    "pilot": {
        "sentence": [
            "My dream is to become a pilot and fly a big airplane.",
            "我的梦想是成为一名飞行员，驾驶大飞机。"
        ]
    },
    "succeed": {
        "sentence": [
            "If you work hard, you will succeed in the final exam.",
            "如果你努力学习，你会在期末考试中取得成功。"
        ]
    },
    "flight": {
        "sentence": [
            "Our flight to Beijing will take off at three o'clock this afternoon.",
            "我们飞往北京的航班将在今天下午三点起飞。"
        ]
    },
    "because of": {
        "sentence": [
            "The football match was cancelled because of the heavy rain.",
            "足球赛因为大雨被取消了。"
        ]
    },
    "exactly": {
        "sentence": [
            "What exactly do you want to do this weekend?",
            "你这个周末到底想做什么？"
        ]
    },
    "take care": {
        "sentence": [
            "Please take care of your little sister when mom is out.",
            "妈妈不在家的时候请照顾好你的妹妹。"
        ]
    },
    "sir": {
        "sentence": [
            "Excuse me, sir, you dropped your wallet on the floor.",
            "先生，打扰一下，您的钱包掉在地上了。"
        ]
    },
    "officer": {
        "sentence": [
            "The police officer helped us find the way to the museum.",
            "那位警察帮助我们找到了去博物馆的路。"
        ]
    },
    "stupid": {
        "sentence": [
            "It is stupid to go out without a coat on such a cold day.",
            "这么冷的天不穿外套就出去是很愚蠢的。"
        ]
    },
    "take off": {
        "sentence": [
            "Please fasten your seat belt before the plane takes off.",
            "请在飞机起飞前系好安全带。"
        ]
    },
    "jacket": {
        "sentence": [
            "He put on his jacket and went out to play with his friends.",
            "他穿上夹克，然后出去和朋友玩了。"
        ]
    },
    "ours": {
        "sentence": [
            "This blue bike is ours, and that red one belongs to Tom.",
            "这辆蓝色的自行车是我们的，那辆红色的是汤姆的。"
        ]
    },
    "tie": {
        "sentence": [
            "My father wears a tie to work every day.",
            "我爸爸每天系着领带去上班。"
        ]
    },
    "row": {
        "sentence": [
            "We sit in the front row during the school assembly.",
            "在学校集会时我们坐在前排。"
        ]
    },
    "pool": {
        "sentence": [
            "Children are not allowed to swim in the pool without adults.",
            "没有大人陪同，孩子们不允许在游泳池里游泳。"
        ]
    },
    "pass": {
        "sentence": [
            "I hope I can pass all my subjects this term.",
            "我希望这学期我能通过所有科目。"
        ]
    },
    "secondary": {
        "sentence": [
            "Playing games is secondary; studying is your main job now.",
            "玩游戏是次要的；学习是你现在的主要任务。"
        ]
    },
    "secondary school": {
        "sentence": [
            "My brother will go to secondary school next September.",
            "我哥哥明年九月将要去上中学。"
        ]
    },
    "absent": {
        "sentence": [
            "She was absent from school yesterday because she had a fever.",
            "她昨天因为发烧没来上学。"
        ]
    },
    "bell": {
        "sentence": [
            "The bell rings at eight o'clock, and our class begins.",
            "铃声在八点响起，我们的课就开始了。"
        ]
    },
    "wealthy": {
        "sentence": [
            "The wealthy man donated a lot of money to build a new library.",
            "那个富人捐了很多钱来建一座新图书馆。"
        ]
    },
    "fear": {
        "sentence": [
            "Many children fear the dark and like to sleep with a light on.",
            "许多孩子害怕黑暗，喜欢开着灯睡觉。"
        ]
    },
    "used to": {
        "sentence": [
            "I used to play basketball after school, but now I prefer swimming.",
            "我过去常常放学后打篮球，但现在我更喜欢游泳。"
        ]
    },
    "wealth": {
        "sentence": [
            "Health is more important than wealth for most people.",
            "对大多数人来说，健康比财富更重要。"
        ]
    },
    "double": {
        "sentence": [
            "This math problem is double the difficulty of the last one.",
            "这道数学题的难度是上一道的两倍。"
        ]
    },
    "adj": {
        "sentence": [
            "In the phrase 'a red apple', 'red' is an adjective.",
            "在词组‘一个红苹果’中，‘红’是一个形容词。"
        ]
    },
    "seldom": {
        "sentence": [
            "He is very busy and seldom has time to watch TV.",
            "他非常忙，很少有时间看电视。"
        ]
    },
    "spare": {
        "sentence": [
            "I always carry a spare pen in my school bag.",
            "我总是在书包里带一支备用钢笔。"
        ]
    },
    "spare time": {
        "sentence": [
            "I often read books in my spare time at the weekend.",
            "我经常在周末的业余时间看书。"
        ]
    },
    "speak up": {
        "sentence": [
            "Please speak up; I can't hear you clearly at the back.",
            "请大声点说；我在后面听不清你讲话。"
        ]
    },
    "deaf": {
        "sentence": [
            "The kind teacher uses sign language to teach the deaf students.",
            "那位善良的老师用手语来教失聪的学生。"
        ]
    },
    "tiny": {
        "sentence": [
            "There is a tiny insect on the leaf of this flower.",
            "这朵花的叶子上有一只很小的昆虫。"
        ]
    },
    "electric": {
        "sentence": [
            "My father bought a new electric fan for the living room.",
            "我爸爸为客厅买了一个新的电风扇。"
        ]
    },
    "light": {
        "sentence": [
            "Please turn off the light when you leave the classroom.",
            "离开教室时请关灯。"
        ]
    },
    "candle": {
        "sentence": [
            "We lit a candle when the electricity suddenly went out.",
            "当电突然停了的时候，我们点了一支蜡烛。"
        ]
    },
    "postman": {
        "sentence": [
            "The postman delivers letters and packages to our house every day.",
            "邮递员每天把信件和包裹送到我们家。"
        ]
    },
    "cold": {
        "sentence": [
            "It's very cold outside, so remember to wear your warm coat.",
            "外面很冷，所以记得穿上你的保暖外套。"
        ]
    },
    "heat": {
        "sentence": [
            "The heat from the sun makes us feel warm in summer.",
            "夏天，太阳的热量让我们感到温暖。"
        ]
    },
    "full-time": {
        "sentence": [
            "Her mother has a full-time job at a local hospital.",
            "她妈妈在当地医院有一份全职工作。"
        ]
    },
    "afford": {
        "sentence": [
            "I saved my pocket money to afford this new dictionary.",
            "我省下零花钱才买得起这本新词典。"
        ]
    },
    "role": {
        "sentence": [
            "He played the role of a brave knight in the school play.",
            "他在学校话剧里扮演了一个勇敢的骑士。"
        ]
    },
    "education": {
        "sentence": [
            "A good education is very important for our future.",
            "良好的教育对我们的未来非常重要。"
        ]
    },
    "transport": {
        "sentence": [
            "Many students use bicycles as their main transport to school.",
            "许多学生把自行车作为他们上学的主要交通工具。"
        ]
    },
    "set off": {
        "sentence": [
            "We will set off for the park at seven tomorrow morning.",
            "我们明天早上七点出发去公园。"
        ]
    },
    "sock": {
        "sentence": [
            "I need to find a pair of clean socks for P.E. class.",
            "我需要找一双干净的袜子上体育课。"
        ]
    },
    "whenever": {
        "sentence": [
            "You can call me whenever you need help with your homework.",
            "无论何时你需要作业帮助，你都可以打电话给我。"
        ]
    },
    "proper": {
        "sentence": [
            "Wearing proper clothes is necessary for the school trip.",
            "为这次学校旅行，穿合适的衣服是必要的。"
        ]
    },
    "edge": {
        "sentence": [
            "Be careful not to stand too close to the edge of the pool.",
            "小心不要站得离游泳池边太近。"
        ]
    },
    "yourself": {
        "sentence": [
            "You should learn to finish your homework by yourself.",
            "你应该学会自己完成作业。"
        ]
    },
    "go off": {
        "sentence": [
            "The alarm clock will go off at six thirty tomorrow morning.",
            "闹钟会在明天早上六点半响起。"
        ]
    },
    "starve": {
        "sentence": [
            "I'm starving; let's have lunch as soon as possible.",
            "我快饿死了；我们尽快吃午饭吧。"
        ]
    },
    "go": {
        "sentence": [
            "We usually go to the library to study on Saturday afternoons.",
            "我们通常在星期六下午去图书馆学习。"
        ]
    },
    "in one go": {
        "sentence": [
            "He finished reading the short story in one go.",
            "他一口气读完了那个短篇故事。"
        ]
    },
    "rock": {
        "sentence": [
            "Children should not throw rocks at animals or people.",
            "孩子们不应该向动物或人扔石头。"
        ]
    },
    "rock climbing": {
        "sentence": [
            "Rock climbing is an exciting but dangerous outdoor activity.",
            "攀岩是一项刺激但危险的户外活动。"
        ]
    },
    "stone": {
        "sentence": [
            "There is a small stone bridge over the river near our village.",
            "我们村附近的河上有一座小石桥。"
        ]
    },
    "fairly": {
        "sentence": [
            "She is fairly good at drawing pictures of animals.",
            "她画动物画得相当好。"
        ]
    },
    "smooth": {
        "sentence": [
            "The surface of the new desk is very smooth and clean.",
            "这张新桌子的表面非常光滑干净。"
        ]
    },
    "straight": {
        "sentence": [
            "Go straight along this road, and you will see the post office.",
            "沿着这条路直走，你就会看到邮局。"
        ]
    },
    "tent": {
        "sentence": [
            "We slept in a tent during our camping trip last summer.",
            "去年夏天露营时，我们睡在帐篷里。"
        ]
    },
    "fall": {
        "sentence": [
            "Leaves turn yellow and fall from the trees in autumn.",
            "秋天，树叶变黄并从树上落下。"
        ]
    },
    "fall asleep": {
        "sentence": [
            "He was so tired that he fell asleep during the movie.",
            "他太累了，以至于在看电影时睡着了。"
        ]
    },
    "hang": {
        "sentence": [
            "Please hang your coat on the hook behind the door.",
            "请把你的外套挂在门后的钩子上。"
        ]
    },
    "sudden": {
        "sentence": [
            "A sudden noise from outside made the little girl very scared.",
            "外面突然的响声让小女孩非常害怕。"
        ]
    },
    "gun": {
        "sentence": [
            "Police officers sometimes carry a gun to protect people.",
            "警察有时会携带枪支来保护人们。"
        ]
    },
    "soft": {
        "sentence": [
            "The new pillow is very soft and comfortable to sleep on.",
            "新枕头非常柔软，睡在上面很舒服。"
        ]
    },
    "still": {
        "sentence": [
            "Please sit still while the teacher is talking.",
            "老师讲话时请安静地坐着别动。"
        ]
    },
    "wood": {
        "sentence": [
            "This old table is made of strong and beautiful wood.",
            "这张旧桌子是用坚固而美丽的木头制成的。"
        ]
    },
    "blood": {
        "sentence": [
            "The nurse took a little blood from his finger for the test.",
            "护士从他的手指上取了一点血做化验。"
        ]
    },
    "catch up": {
        "sentence": [
            "I need to study hard to catch up with my classmates in math.",
            "我需要努力学习，在数学上赶上我的同学们。"
        ]
    },
    "agreement": {
        "sentence": [
            "After long discussion, they finally reached an agreement.",
            "经过长时间的讨论，他们终于达成了一致。"
        ]
    },
    "blind": {
        "sentence": [
            "The blind man walks across the street with the help of his dog.",
            "那位盲人在他的狗的帮助下过马路。"
        ]
    },
    "ouch": {
        "sentence": [
            "Ouch! I hit my knee on the corner of the desk.",
            "哎哟！我的膝盖撞到桌角了。"
        ]
    },
    "call off": {
        "sentence": [
            "They had to call off the picnic because of the bad weather.",
            "因为天气不好，他们不得不取消了野餐。"
        ]
    },
    "thanks to": {
        "sentence": [
            "Thanks to your help, I finished my project on time.",
            "多亏了你的帮助，我按时完成了我的项目。"
        ]
    },
    "health care": {
        "sentence": [
            "Good health care is important for everyone, especially the old.",
            "良好的医疗保健对每个人都很重要，尤其是老人。"
        ]
    },
    "expect": {
        "sentence": [
            "I expect to receive a birthday gift from my parents this year.",
            "我期待今年能收到父母的一份生日礼物。"
        ]
    },
    "require": {
        "sentence": [
            "This job requires you to work for eight hours a day.",
            "这份工作要求你每天工作八小时。"
        ]
    },
    "physical": {
        "sentence": [
            "Physical exercise is good for both our body and mind.",
            "体育锻炼对我们的身体和头脑都有好处。"
        ]
    },
    "effort": {
        "sentence": [
            "With great effort, he finally solved the difficult problem.",
            "通过巨大的努力，他终于解决了那个难题。"
        ]
    },
    "once in a while": {
        "sentence": [
            "Once in a while, our family goes to the cinema on weekends.",
            "偶尔，我们家会在周末去电影院。"
        ]
    },
    "harm": {
        "sentence": [
            "Smoking will harm your health, so please don't try it.",
            "吸烟会损害你的健康，所以请不要尝试。"
        ]
    },
    "invitation": {
        "sentence": [
            "I received an invitation to Lucy's birthday party yesterday.",
            "昨天我收到了露西生日派对的邀请。"
        ]
    },
    "invite": {
        "sentence": [
            "My best friend invited me to her house for dinner last Sunday.",
            "上周日，我最好的朋友邀请我去她家吃晚饭。"
        ]
    },
    "calendar": {
        "sentence": [
            "There is a beautiful picture on the wall calendar in my room.",
            "我房间的挂历上有一幅漂亮的图片。"
        ]
    },
    "balloon": {
        "sentence": [
            "The children were playing with colourful balloons at the party.",
            "孩子们在派对上玩着五颜六色的气球。"
        ]
    },
    "paint": {
        "sentence": [
            "We will paint the fence white during the art class tomorrow.",
            "明天美术课上我们要把栅栏漆成白色。"
        ]
    },
    "heat up": {
        "sentence": [
            "You can heat up the soup in the microwave for two minutes.",
            "你可以用微波炉把汤加热两分钟。"
        ]
    },
    "knife": {
        "sentence": [
            "Please be careful when you use a knife to cut the bread.",
            "当你用刀切面包时请小心。"
        ]
    },
    "fork": {
        "sentence": [
            "In Western countries, people usually eat with a knife and fork.",
            "在西方国家，人们通常用刀叉吃饭。"
        ]
    },
    "spoon": {
        "sentence": [
            "She uses a spoon to eat soup and a fork to eat salad.",
            "她用勺子喝汤，用叉子吃沙拉。"
        ]
    },
    "cheeseburger": {
        "sentence": [
            "I often order a cheeseburger and a cup of milk for lunch.",
            "我午餐经常点一个芝士汉堡和一杯牛奶。"
        ]
    },
    "Italian": {
        "sentence": [
            "My father likes Italian food, especially pizza and pasta.",
            "我爸爸喜欢意大利食物，尤其是披萨和意大利面。"
        ]
    },
    "Westerner": {
        "sentence": [
            "Many Westerners celebrate Christmas with their families.",
            "许多西方人和家人一起庆祝圣诞节。"
        ]
    },
    "West": {
        "sentence": [
            "The sun sets in the West at the end of the day.",
            "太阳在一天结束时从西边落下。"
        ]
    },
    "serve": {
        "sentence": [
            "The waiter will serve drinks and food to the customers.",
            "服务员将为顾客端上饮料和食物。"
        ]
    },
    "similar": {
        "sentence": [
            "Your new bicycle is similar to mine, but mine is blue.",
            "你的新自行车和我的相似，但我的那辆是蓝色的。"
        ]
    },
    "wing": {
        "sentence": [
            "The bird broke its wing and couldn't fly back to its nest.",
            "那只鸟的翅膀受伤了，无法飞回它的巢。"
        ]
    },
    "lady": {
        "sentence": [
            "The kind lady helped the lost boy find his parents.",
            "那位善良的女士帮助迷路的小男孩找到了他的父母。"
        ]
    },
    "gentleman": {
        "sentence": [
            "He is a true gentleman who always holds the door for others.",
            "他是一位真正的绅士，总是为别人扶着门。"
        ]
    },
    "help yourself": {
        "sentence": [
            "Please help yourself to some fruit on the table.",
            "请随便吃点桌子上的水果。"
        ]
    },
    "cross": {
        "sentence": [
            "Remember to look both ways before you cross the street.",
            "过马路前记得要左右看看。"
        ]
    },
    "achieve": {
        "sentence": [
            "With enough practice, you can achieve your goal of swimming well.",
            "通过足够的练习，你可以达到游好泳的目标。"
        ]
    },
    "including": {
        "sentence": [
            "All students, including those who are sick, must finish the homework.",
            "所有学生，包括生病的那些，都必须完成作业。"
        ]
    },
    "speaker": {
        "sentence": [
            "The guest speaker told us interesting stories about his travels.",
            "特邀演讲者给我们讲了他旅行的有趣故事。"
        ]
    },
    "boss": {
        "sentence": [
            "Her boss is very strict but also fair to all the workers.",
            "她的老板非常严格，但对所有工人也很公平。"
        ]
    },
    "secretary": {
        "sentence": [
            "The school secretary answers phone calls and helps visitors.",
            "学校秘书接听电话并帮助来访者。"
        ]
    },
    "quarter": {
        "sentence": [
            "It's a quarter past seven; we have fifteen minutes before class.",
            "现在是七点一刻；我们离上课还有十五分钟。"
        ]
    },
    "industry": {
        "sentence": [
            "This city is famous for its car industry and technology.",
            "这座城市以其汽车工业和技术而闻名。"
        ]
    },
    "zero": {
        "sentence": [
            "The temperature dropped to zero degrees last night.",
            "昨晚气温降到了零度。"
        ]
    },
    "Indian": {
        "sentence": [
            "My neighbour is Indian, and she sometimes cooks delicious curry.",
            "我的邻居是印度人，她有时会做美味的咖喱。"
        ]
    },
    "type": {
        "sentence": [
            "What type of music do you like to listen to, pop or rock?",
            "你喜欢听什么类型的音乐，流行乐还是摇滚乐？"
        ]
    },
    "handbag": {
        "sentence": [
            "She put her keys and phone into her small handbag.",
            "她把钥匙和手机放进了她的小手提包里。"
        ]
    },
    "beat": {
        "sentence": [
            "Our school basketball team beat their team in the final game.",
            "我们学校的篮球队在决赛中打败了他们队。"
        ]
    },
    "pardon": {
        "sentence": [
            "Pardon? Could you please repeat the question more slowly?",
            "抱歉？你能请慢点重复一遍那个问题吗？"
        ]
    },
    "intend": {
        "sentence": [
            "I intend to visit my grandparents during the summer holiday.",
            "我打算暑假期间去看望我的祖父母。"
        ]
    },
    "fetch": {
        "sentence": [
            "Could you please fetch me a glass of water from the kitchen?",
            "你能请从厨房给我拿一杯水来吗？"
        ]
    },
    "pancake": {
        "sentence": [
            "My mother makes delicious pancakes for us on Sunday mornings.",
            "我妈妈在星期天早上为我们做好吃的薄煎饼。"
        ]
    },
    "rose": {
        "sentence": [
            "He gave his mother a beautiful red rose on her birthday.",
            "他在母亲生日时送了她一朵美丽的红玫瑰。"
        ]
    },
    "laugh at": {
        "sentence": [
            "It's not polite to laugh at others when they make mistakes.",
            "当别人犯错时嘲笑他们是不礼貌的。"
        ]
    },
    "kindness": {
        "sentence": [
            "We should always show kindness to animals and people in need.",
            "我们应该永远对动物和有需要的人表现出善意。"
        ]
    },
    "give up": {
        "sentence": [
            "Don't give up easily when you face difficulties in learning.",
            "当你在学习中遇到困难时不要轻易放弃。"
        ]
    },
    "try one": {
        "sentence": [
            "This chocolate is very good; would you like to try one?",
            "这种巧克力很好吃；你想尝一个吗？"
        ]
    },
    "disappointed": {
        "sentence": [
            "She was very disappointed because she failed the history test.",
            "她非常失望，因为她历史考试没及格。"
        ]
    },
    "bedside": {
        "sentence": [
            "There is a lamp and a clock on my bedside table.",
            "我的床头柜上有一盏灯和一个闹钟。"
        ]
    },
    "note": {
        "sentence": [
            "I left a note on the fridge to remind my brother about the meeting.",
            "我在冰箱上留了张便条提醒我弟弟开会的事。"
        ]
    },
    "whom": {
        "sentence": [
            "Whom did you invite to your birthday party last weekend?",
            "上周末你邀请了谁参加你的生日派对？"
        ]
    },
    "try one's best": {
        "sentence": [
            "You should try your best to finish the task on time.",
            "你应该尽力按时完成任务。"
        ]
    }
}